1) ввести список чисел, список произвольной длинны.
--Определить сколько чисел в списке четных , а сколько нечетных
-- Нужно проверить, все ли числа в последовательности уникальны. (колллекция с уникальными значениями)

2) задан словарь, в котором для каждого студента определены оценки за экзамены
Определить кто из студентов не завершил сессию (оценок меньше пяти)
Для тех кто завершил сессию – рассчитать средний балл
{‘Вася’:[3,5,4,4,4], ‘Петя’:[3,5,4,5], ‘Маша’:[5,4,5,4,4], } (методы словаря , списка)

3) Пользователь вводит слова с клавиатуры (каждое слово отдельный ввод, окончание ввода - 0).
Вывести список слов, которые пользователь ввел более трех раз (рекомендация: решать через словарь )

4) в три магазина осуществляется доставка продуктов. Доставка возможна с понедельника по пятницу (1-5).
Написать программу которая позволит задать расписание для каждого магазина (0 – окончание ввода).
После этого программа должна выполнять анализ введенных расписаний:
- определять в какие магазины осуществляется доставка каждый день
- в какой день (дни) надо ехать во все магазины

while True:
    print("enter number")
    n = int(input())
    list_from_input_user.append(n)
    if n == 0:
        break
print("numbers", list_from_input_user)


while True:
    print("enter word")
    n = input()
    if n == '0':
        break

while True:
    print("print days for ", shop_name_one)
    i = int(input())
    if i == 0:
        break
    shop_one_days.append(i)

shop_dict = {shop_name_one: set(shop_one_days)}

print(shop_dict)